{"reqs":"This course is a general survey of world archaeology, from emergence of the first tool-using humans approximately 3.3 million years ago to the development of ancient state-level societies starting 7-8 thousand years ago, illustrated by select research and archaeological sites. The course also examines some of the methods and theories archaeologists use to reconstruct ancient lifeways and understand processes underlying major changes through human history. Required textbook: Feder, Kenneth (2016) The Past in Perspective: An Introduction to Human Prehistory, 7th edition. Oxford University Press.\nThe course consists of two 50-minute lectures, on Mondays and Wednesdays. The 3rd session, on Fridays, also 50 minutes, is for discussion with TAs. Select one Discussion from sections D1B, D1C, D1D, D1E.\n\nThis course is a general survey of world archaeology, from emergence of the first tool-using humans ca. 3.3 million years ago to the development of ancient state-level societies starting 7-8 thousand years ago, illustrated by select research and archaeological sites. The course also examines some of the methods and theories archaeologists use to reconstruct ancient lifeways and understand processes underlying major changes through human history. Required textbook: Feder, Kenneth (2016) The Past in Perspective: An Introduction to Human Prehistory, 7th edition. Oxford University Press.\nThe course consists of two 50-minute lectures, on Mondays and Wednesdays. The 3rd session, on Fridays, also 50 minutes, is for discussion with TAs. Select one Discussion from sections D2A, D2B, D2C, D2D, D2G.\n","courseName":"Introduction to Archaeology","courseNumber":"103","credits":"Credits: 3","description":"Survey of world archaeology, from the emergence of humankind to the beginning of state societies.","sections":[{"section":"100"},{"section":"002"},{"section":"D2A"},{"section":"D1B"},{"section":"D2C"},{"section":"D2B"},{"section":"D1D"},{"section":"D2E"},{"section":"D1C"},{"section":"D2D"},{"section":"D1E"}]}