{"reqs":"Co-reqs: One of BIOC 300, BIOC 302, BIOC 303.\n\nEntry to this course is normally restricted to third year students in Biochemistry major and honours programs, who have completed appropriate 1st and 2nd year program requirements, and to Physiology, Pharmacology and Honours Biophysics students who have received approval for their programs. The academic records of all students who register into the course will be checked and those not having an appropriate academic background for their designated specialization will be de-registered. Additionally, registration in co-requisite courses (Bioc 302 or Bioc 303) will be checked and any students not registered in the appropriate course may be removed from Bioc 301.\n\n\nNo preference is given to 4th year students and, accordingly, direct registration is restricted to students with 3rd year standing in the Faculty of Science. Eligible 4th year students needing to take the course should register into the wait-list section and contact the Biochemistry adviser (jaread@mail.ubc.ca) to request entry to the course. Approved 4th year students will be registered by the department when their academic standing matches that of the incoming 3rd year class.\nWait list for lab and lecture; students wanting to be considered for admission to the course should register into the wait list and contact the Biochemistry adviser (jaread@interchange.ubc.ca) to outline their reasons for wanting to take BIOC301.\n- Wait listing does not guarantee placement in the course - please check the SSC periodically to determine if you have been moved into the course, and ensure that your Email address on the UBC system is up-to-date to receive Email announcements about the status of the wait list. Students with weak or deficient academic records, who have no probability of being placed in the course, will be de-registered from the wait list.\nLAB CHECK-IN COPP BUILDING ROOM 2020.\n\nStudents who do not attend check-in may be de-registered from the course. Contact the instructor at 604-822-7582 (Email: jaread@interchange.ubc.ca) if you are unable to attend.\nCHECK-IN 2:00 PM, COPP BUILDING ROOM 2020.\n\nStudents who do not attend check-in may be de-registered from the course. Contact the instructor at 604-822-7582 (Email: jaread@interchange.ubc.ca) if you are unable to attend.\nCHECK-IN 2:00 PM, COPP BUILDING ROOM 2020.\n\nStudents who do not attend check-in may be de-registered from the course. Contact the instructor at 604-822-7582 (Email: jaread@interchange.ubc.ca) if you are unable to attend.\nCHECK-IN 2:00 PM, COPP BUILDING ROOM 2020.\n\nStudents who do not attend check-in may be de-registered from the course. Contact the instructor at 604-822-7582 (Email: jaread@interchange.ubc.ca) if you are unable to attend.\n","courseName":"Biochemistry Laboratory","courseNumber":"301","credits":"Credits: 3","description":"Techniques by which the chemical and physical properties of fundamental components of the cell are studied.","sections":[{"section":"L04"},{"section":"001"},{"section":"L01"},{"section":"L03"},{"section":"L02"}]}