{"reqs":"Pre-reqs: Not open to students with credit for CHEM 12.\nNOTE: To complete registration, students must register for BOTH lecture and laboratory activities. Incomplete registration will result in being placed on the waitlist.\nNOTE: To complete registration, students must register for BOTH lecture and laboratory activities. Incomplete registration will result in being placed on the waitlist.\nLab starts the SECOND week of T1.\nStudents who do not attend the first laboratory meeting of this course will be DEREGISTERED from the course.\nLab starts the SECOND week of T1.\nStudents who do not attend the first laboratory meeting of this course will be DEREGISTERED from the course.\nLab starts the SECOND week of T1.\nStudents who do not attend the first laboratory meeting of this course will be DEREGISTERED from the course.\nLab for EXEMPTED students only. Lab XMT is NOT available for direct registration by students.\nLab XMT is **ONLY** for students repeating this course who have successfully completed the laboratory component of this course during their previous registration in the course. Such students should **NOT** register in a regular laboratory; the department will place you into the exempt laboratory. Students who are registered in laboratory section XMT do NOT have to attend the laboratory orientation for the course. Your previous grade in the laboratory will be used in determining your final grade this year.\nThis waitlist is for BOTH the lecture and the laboratory. You will be moved into active registration IF space becomes available. Timetables MAY BE MODIFIED to allow conflict-free registration. Waitlisting does not guarantee placement in this course. If you are waitlisted, it is recommended that you access the SSC periodically to check your status. It is YOUR responsibility to check the SSC for registration changes.\nThis waitlist is for BOTH the lecture and the laboratory. You will be moved into active registration IF space becomes available. Timetables MAY BE MODIFIED to allow conflict-free registration. Waitlisting does not guarantee placement in this course. If you are waitlisted, it is recommended that you access the SSC periodically to check your status. It is YOUR responsibility to check the SSC for registration changes.\n","courseName":"Structure, Bonding, and Equilibrium in Chemistry","courseNumber":"111","credits":"Credits: 4","description":"Fundamentals of bonding theories, structural chemistry and equilibrium with applications relevant to modern society.","sections":[{"section":"L07"},{"section":"112"},{"section":"L06"},{"section":"L02"}]}