{"reqs":"If you are registered in this course: Select one tutorial from sections T01 to T10\nIf you are registered in this course: Select one tutorial from sections T11 to T16.\n1W1 is a Wait List for Section 99A of CLST 301 offered in September.\nPlease only register in the Wait List Section if 99A is already full.\nPLEASE NOTE: Please register in the Wait List Section 1W1 if Section 99A is full or blocked. Students will be moved from the waitlist in registration order.\nThis section of the course is ONLINE- distance education. Your instructor and course support staff will contact you by email prior to and during the course. Please ensure you have a valid email account. You will need your Campus Wide Login (CWL) to login to your course at https://www.elearning.ubc.ca/ . Course materials must be ordered or picked up at the UBC Bookstore. More information can be found under Distance Education at : http://ctlt.ubc.ca/ It is important to be sure that your distance course is eligible under the student loan program. For your reference: http://www.students.ubc.ca/finance/loans.cfm?page=courseloads.\nWhere applicable, please visit this site for examination information: http://www.students.ubc.ca/coursesreg/exams/\n2W1 is a Wait List for Section 99C of CLST 301 offered in January. Please only register in the Wait List Section if 99C is already full.\nPLEASE NOTE: Please register in the Wait List Section 2W1 if Section 99C is full or blocked. Students will be moved from the waitlist in registration order.\nThis section of the course is ONLINE- distance education. Your instructor and course support staff will contact you by email prior to and during the course. Please ensure you have a valid email account through Interchange/Netinfo. You will need your Campus Wide Login (CWL) to login to your course at https://www.elearning.ubc.ca/ . Course materials must be ordered or picked up at the UBC Bookstore. More information can be found under Distance Education at : http://ctlt.ubc.ca/ It is important to be sure that your distance course is eligible under the student loan program. For your reference: http://www.students.ubc.ca/finance/loans.cfm?page=courseloads.\nWhere applicable, please visit this site for examination information: http://www.students.ubc.ca/coursesreg/exams/\n","courseName":"The Technical Terms of Medicine and Biological Science","courseNumber":"301","credits":"Credits: 3","description":"Acquaints the student with the Greek and Latin elements from which most specialized terms of modern medicine are constructed. Intended primarily for students planning to enter the medical, pharmaceutical, or biological sciences.","sections":[{"section":"001"},{"section":"99A"},{"section":"99C"},{"section":"051"},{"section":"T10"},{"section":"T01"},{"section":"T12"},{"section":"T11"},{"section":"T03"},{"section":"T14"},{"section":"T02"},{"section":"T13"},{"section":"T05"},{"section":"T16"},{"section":"T04"},{"section":"T15"},{"section":"T07"},{"section":"T06"},{"section":"T09"},{"section":"T08"}]}