{"reqs":"If this section is full please consider registering on wait list 1W1, or another section.\nCPSC 110 is the shortest route to CPSC 210 and the rest of the Computer Science major and mini-streams. If you plan to complete a Computer Science major or honours degree (including combined majors and dual majors) or need CPSC 110 to fulfill a degree requirement you should take CPSC 110. Students who are not planning to focus on Computer Science may also find that CPSC 110 best matches their needs and interests. For more information on how to select a first year CS course go to: https://www.cs.ubc.ca/students/undergrad/courses/choose-your-first-course\nThis lab section is recommended for students in the BCS program.\nIf this section is full please consider registering in another section or register on the wait list. CPSC 110 is the shortest route to CPSC 210 and the rest of the Computer Science major and mini-streams. If you plan to complete a Computer Science major or honours degree (including combined majors and dual majors) or need CPSC 110 to fulfill a degree requirement you should take CPSC 110. Students who are not planning to focus on Computer Science may also find that CPSC 110 best matches their needs and interests. For more information on how to select a first year CS course go to: https://www.cs.ubc.ca/students/undergrad/courses/choose-your-first-course\nThis lab section is recommended for students in the BCS program.\nThis lab section is recommended for students in the BCS program.\nThis is the CPSC 110 challenge exam section for students who may have completed a course of studies similar to CPSC 110, but who have not received transfer credit for CPSC 110. Please note that students can not get credit towards a degree for both our old CPSC 111, and for CPSC 110. Please see the provided course link for details on applying to write the challenge exam, the costs, and the registration process\nIf this section is full please consider registering on the wait list or another section of CPSC 110. CPSC 110 is the shortest route to CPSC 210 and the rest of the Computer Science major and mini-streams. If you plan to complete a Computer Science major or honours degree (including combined majors and dual majors) or need CPSC 110 to fulfill a degree requirement you should take CPSC 110. Students who are not planning to focus on Computer Science may also find that CPSC 110 best matches their needs and interests. For more information on how to select a first year CS course go to: https://www.cs.ubc.ca/students/undergrad/courses/choose-your-first-course\nNote: Depending upon how many students sign-up for this section either an additional lab section will be opened or the existing labs will be expanded slightly so as to have a sufficient number of seats for the students registered in the course. However, there is no guarantee that the resulting seats will fit your time table so make sure to take that into consideration when planning your time table.\nNote: Depending upon how many students sign-up for this section either an additional lab section will be opened or the existing labs will be expanded slightly so as to have a sufficient number of seats for the students registered in the course. However, there is no guarantee that the resulting seats will fit your time table so make sure to take that into consideration when planning your time table.\nThis section is available only to students registered in Vantage College.\nThis section is available only to students registered in Vantage College.\nThis section is available only to students registered in Vantage College.\nThis section is available only to students registered in Vantage College.\nThis section is available only to students registered in Vantage College.\n","courseName":"Computation, Programs, and Programming","courseNumber":"110","credits":"Credits: 4","description":"Fundamental program and computation structures. Introductory programming skills. Computation as a tool for information processing, simulation and modeling, and interacting with the world.","sections":[{"section":"L1F"},{"section":"V01"},{"section":"L1E"},{"section":"L1H"},{"section":"VAN"},{"section":"L1G"},{"section":"L1J"},{"section":"L1L"},{"section":"L1K"},{"section":"L1N"},{"section":"L1M"},{"section":"L1P"},{"section":"L1R"},{"section":"L1Q"},{"section":"L1T"},{"section":"L1S"},{"section":"L1V"},{"section":"L1U"},{"section":"L1X"},{"section":"L1W"},{"section":"TZZ"},{"section":"L2A"},{"section":"L2C"},{"section":"L2B"},{"section":"L2E"},{"section":"L2D"},{"section":"L2G"},{"section":"L2F"},{"section":"L2H"},{"section":"L2K"},{"section":"V2A"},{"section":"L2J"},{"section":"L2M"},{"section":"V2C"},{"section":"V2B"},{"section":"L2L"},{"section":"V2D"},{"section":"L2N"},{"section":"L2Q"},{"section":"L2P"},{"section":"L2S"},{"section":"L2R"},{"section":"L2U"},{"section":"L2T"},{"section":"L2W"},{"section":"L2V"},{"section":"201"},{"section":"L2X"},{"section":"202"},{"section":"203"},{"section":"L11"},{"section":"L15"},{"section":"101"},{"section":"L17"},{"section":"103"},{"section":"L1B"},{"section":"L1A"},{"section":"L1D"},{"section":"L1C"}]}