{"reqs":"Pre-reqs: ((Pre-requisites must be met by the first day of class or students will be withdrawn). Third year standing and, one of (a) 6 credits of 100-level English; or, (b) WRDS 150 or ASTU 150 plus 3 credits of 100-level English; or, (c) 6 credits of ASTU 100 or 3 credits of ASTU 100 and 3 credits of 100-level English; or, (d) ARTS 001.)\nTo take ENGL 301, students need to have 3rd-year standing and must have completed 6 credits of 1st year English, normally any two of ENGL 100, ENGL 110, ENGL 111, ENGL 112, ENGL 120, ENGL 121, ASTU 150/WRDS 150 or successful completion of the Arts One or Coordinated Arts Program.\nThis section of the course is ONLINE- distance education. Your instructor and course support staff will contact you by email prior to and during the course. Please ensure you have a valid email account. You will need your Campus Wide Login (CWL) to login to your course at https://www.elearning.ubc.ca/ Course materials must be ordered or picked up at the UBC Bookstore. More information can be found under Distance Learning at : http://ctlt.ubc.ca/\nWhere applicable, please visit this site for examination information: http://www.students.ubc.ca/coursesreg/exams/\nNOTE #1: To waitlist for this course, contact the English Dept.: english.undergraduate@ubc.caNOTE #2: COMMERCE students may not take this course for credit toward their program.\nTo take ENGL 301, students need to have 3rd-year standing and must have completed 6 credits of 1st year English, normally any two of ENGL 100, ENGL 110, ENGL 111, ENGL 112, ENGL 120, ENGL 121, ASTU 150/WRDS 150 or successful completion of the Arts One or Coordinated Arts Program.\nThis section of the course is ONLINE- distance education. Your instructor and course support staff will contact you by email prior to and during the course. Please ensure you have a valid email account. You will need your Campus Wide Login (CWL) to login to your course at https://www.elearning.ubc.ca/ Course materials must be ordered or picked up at the UBC Bookstore. More information can be found under Distance Learning at : http://ctlt.ubc.ca/\nWhere applicable, please visit this site for examination information: http://www.students.ubc.ca/coursesreg/exams/\nNote #1: To waitlist for this section once it is full, please contact the English Dept: english.undergraduate@ubc.caNote #2: This course is not open to students in the Faculty of Commerce.\n","courseName":"Technical Writing","courseNumber":"301","credits":"Credits: 3","description":"Study of the principles of written communication in general business and professional activities, and practice in the preparation of abstracts, proposals, reports, and correspondence. This course is closed to first- and second-year students in Arts. Not for credit towards the English Major or Minor.","sections":[{"section":"001"},{"section":"99A"},{"section":"99C"}]}