{"reqs":"Course Description and Aims:\nThis is a survey course in moral theory. We will consider what things are valuable and worth desiring, which actions are right and which ones wrong, what it is to live a good life, and related questions about what to do, what to value, and who to be. The dominant ethical theories offer very diverse answers to these questions, ranging from the claim that you should do whatever your cultures norms tell you to do, to the claim that there are universal moral norms that you would be irrational to violate.\nThe aim in this course is not only to familiarize you with some of the most profound questions one can ask, and the most thoughtful attempts to answer those questions, but also to hone your thinking and writing skills. I want you to think clearly, avoid confusion, pick apart bad arguments, and build good arguments.\nCourse Description and Aims:\nThis is a survey course in moral theory. We will consider what things are valuable and worth desiring, which actions are right and which ones wrong, what it is to live a good life, and related questions about what to do, what to value, and who to be. The dominant ethical theories offer very diverse answers to these questions, ranging from the claim that you should do whatever your cultures norms tell you to do, to the claim that there are universal moral norms that you would be irrational to violate.\nThe aim in this course is not only to familiarize you with some of the most profound questions one can ask, and the most thoughtful attempts to answer those questions, but also to hone your thinking and writing skills. I want you to think clearly, avoid confusion, pick apart bad arguments, and build good arguments.\nWhat makes an action morally wrong, or morally right? What makes a person or a state affairs good, or bad? This course offers an introduction to various moral theories, each of which attempt to answer these fundamental questions. Theories to be studied may include divine command theory, consequentialism, Kantianism, pluralism, and virtue ethics. We will also entertain some metaethical questions along the way; questions about moral properties and the meaning of moral language.\n","courseName":"Introduction to Ethics","courseNumber":"230","credits":"Credits: 3","description":"Theories of obligation and value; moral reasoning; normative ethics, descriptive ethics and meta-ethics. Readings in classic and contemporary texts.","sections":[{"section":"003"},{"section":"001"},{"section":"002"}]}