{"reqs":"This course is not recommended for students with more than 90 credits.\n\nThis course is not recommended for students with more than 90 credits.\nThe course is a basic introduction to logic and critical reasoning. It is designed to equip the students with the tools and concepts needed to deal with both everyday and more technical arguments, as well as the skills to analyse, and resolve, everyday confusions, ambiguities, and fallacies. Topics covered include the distinction between logic and rhetoric; the analysis and resolution of ambiguities and fallacies; validity and inductive strength of arguments; elementary classical propositional and predicate logics; term, multi-valued and relevance logics.\nThis course is not recommended for students with more than 90 credits.\nThis course is not recommended for students with more than 90 credits.\nThis online Distance Education course is a basic introduction to logic and critical reasoning. It is designed to equip the students with the tools and concepts needed to deal with both everyday and more technical arguments, as well as the skills to analyse, and resolve, everyday confusions, ambiguities, and fallacies. Topics covered include the distinction between logic and rhetoric; the analysis and resolution of ambiguities and fallacies; validity and inductive strength of arguments; elementary classical propositional and predicate logics; term, modal, multi-valued and relevance logics.\n\nThis course is not recommended for students with more than 90 credits.\nThis online Distance Education course is a basic introduction to logic and critical reasoning. It is designed to equip the students with the tools and concepts needed to deal with both everyday and more technical arguments, as well as the skills to analyse, and resolve, everyday confusions, ambiguities, and fallacies. Topics covered include the distinction between logic and rhetoric; the analysis and resolution of ambiguities and fallacies; validity and inductive strength of arguments; elementary classical propositional and predicate logics; term, modal, multi-valued and relevance logics.\n\n","courseName":"Introduction to Critical Thinking","courseNumber":"120","credits":"Credits: 3","description":"Tools for dealing with both everyday and more technical arguments and concepts. Analysis and resolution of confusions, ambiguities, and fallacies. This course is restricted to students with fewer than 90 credits.","sections":[{"section":"001"},{"section":"99A"},{"section":"002"},{"section":"003"},{"section":"99C"}]}