{"reqs":"Pre-reqs: One of MATH 101, MATH 103, MATH 105, MATH 121, SCIE 001.\nFor Applied Science students. Select 1 lecture and 1 lab in the same term.\nLabs begin second week of classes.\nSome seats reserved for CHBE\nSome seats reserved for Civil Engineering\nLabs begin second week of classes. Some seats reserved for Civil students\nLabs begin second week of classes. Some seats reserved for students in Chemical and Biological Engineering\nSome seats reserved for Civil\nSome seats reserved for student in Chemical and Biological Engineering\nLabs begin second week of classes.\nLabs begin the second week of classes. Some seats reserved for CPEN\nFor Applied Science students. If you are not in Applied Science, please register in Stat 241. Select one lecture and one lab in the same term.\nNote: please do not register in this course unless you can also find an open seat in a lab section that does not conflict with your schedule. We are not able to overload our labs for any reason, so if you are unable to find a seat in a lab section that does not conflict with yoru schedule, please do not register for the class.\nLabs begin second week of classes.\nSeats reserved for Civil\nLabs start the second week of classes\n","courseName":"Elementary Statistics","courseNumber":"251","credits":"Credits: 3","description":"Probability, discrete and continuous random variables, joint probability distributions, estimation, hypothesis testing, regression, analysis of variance, goodness of fit. (Consult the Credit Exclusion list within the Faculty of Science section of the Calendar).","sections":[{"section":"L1F"},{"section":"L2G"},{"section":"L1E"},{"section":"L1H"},{"section":"L2I"},{"section":"L1G"},{"section":"L2H"},{"section":"L2K"},{"section":"L1I"},{"section":"L2J"},{"section":"L2M"},{"section":"L2L"},{"section":"101"},{"section":"201"},{"section":"L2A"},{"section":"L1B"},{"section":"L2C"},{"section":"L1A"},{"section":"L2B"},{"section":"L1D"},{"section":"L2E"},{"section":"L1C"},{"section":"L2D"}]}