{"reqs":"Pre-reqs: One of MATH 101, MATH 103, MATH 105, MATH 121, SCIE 001.\n\nTHIS LAB WILL TAKE PLACE ON FRIDAYS FROM 10-11 AM\nLabs begin the second week of classes.\nPlease note that we are unable to provide a waitlist service for Stat 200. Students are responsible for monitoring registration, and adding themselves to the course if seats open up. There is generally a lot of movement in course registration right up unti the first week of classes, and most students are able to secure a seat if they are diligent about monitoring enrollment. We are unable to overload the course due to room capacity.\nTHIS LAB WILL TAKE PLACE ON FRIDAYS FROM 10-11 AM\nLabs begin the second week of classes\nNote: please do not register in this course unless you can also find an open seat in a lab section that does not conflict with your schedule. We are not able to overload our labs for any reason, so if you are unable to find a seat in a lab section that does not conflict with yoru schedule, please do not register for the class.\n","courseName":"Elementary Statistics for Applications","courseNumber":"200","credits":"Credits: 3","description":"Classical, nonparametric, and robust inferences about means, variances, and analysis of variance, using computers. Emphasis on problem formulation, assumptions, and interpretation. See the Faculty of Science Credit Exclusion Lists: www.calendar.ubc.ca/vancouver/index.cfm?tree=12,215,410,414.","sections":[{"section":"L1F"},{"section":"L1E"},{"section":"L1H"},{"section":"L1G"},{"section":"L1J"},{"section":"L1I"},{"section":"L1L"},{"section":"L1K"},{"section":"L1N"},{"section":"L1M"},{"section":"L1P"},{"section":"L1O"},{"section":"L1R"},{"section":"L1Q"},{"section":"L1S"},{"section":"L2A"},{"section":"L2C"},{"section":"L2B"},{"section":"L2E"},{"section":"L2D"},{"section":"L2G"},{"section":"L2F"},{"section":"L2I"},{"section":"L2H"},{"section":"L2J"},{"section":"101"},{"section":"103"},{"section":"202"},{"section":"L1B"},{"section":"L1A"},{"section":"L1D"},{"section":"L1C"}]}