{"reqs":"If this section if FULL or BLOCKED please sign up for the corresponding waitlist section - THTR 130, Section WL1 OR if you are a first or second year student who intends to Major in Theatre or Film, please register in THTR 130 WL3. Once you have registered in the waitlist there is no need to contact the Department. Your registration will be switched to the parent section when space becomes available.\nThis is a WAITLIST section for THTR 130 Section 001. Once you have registered in the waitlist there is no need to contact the Department. Your registration will be switched to the parent section when space becomes available.\nThis is a WAITLIST section for THTR 130, Section 001. This waitlist is restricted to first and second year students who plan to Major in Theatre or Film. If space opens in the parent section you will be registered in the parent section on a first-come, first-served basis. You do not need to contact the department. Please periodically check your registration.\nIf this section if FULL or BLOCKED please sign up for the corresponding waitlist section - THTR 130, Section WL2 OR if you are a first or second year studnet who intends to Major in Theatre or Film register in THTR 130, Section WL4. Once you have registered in the waitlist there is no need to contact the Department. Your registration will be switched to the parent section when space becomes available.\nIf this section if FULL or BLOCKED please sign up for the corresponding waitlist section - THTR 130, Section WL5. Once you have registered in the waitlist there is no need to contact the Department. Your registration will be switched to the parent section when space becomes available.\nThis is a WAITLIST section for THTR 130 Section 002. Once you have registered in the waitlist there is no need to contact the Department. Your registration will be switched to the parent section when space becomes available.\nThis is a WAITLIST section for THTR 130, Section 002. This waitlist is restricted to first and second year students who plan to Major in Theatre or Film. If space opens in the parent section you will be registered in the parent section on a first-come, first-served basis. You do not need to contact the department. Please periodically check your registration.\n","courseName":"Introduction to Stage Acting","courseNumber":"130","credits":"Credits: 3","description":"","sections":[{"section":"003"}]}