{"reqs":"Non-Commerce students only. It cannot be counted for credit in the BCom program. If you are unable to register in a section of this course and you have been admitted by your Faculty to the Minor in Commerce or another approved program in which this course is a requirement, you may submit a registration request using the form available on the Sauder website: https://mybcom.sauder.ubc.ca/courses-money-enrolment/courses-and-registration/registration-assistance .\nStudents not meeting any of the criteria within the restricted seats remaining will only be able to register if there are general seats available.\nNOTE: Course registration is administered by the Sauder Undergraduate Office and NOT the instructor (DO NOT CONTACT THE INSTRUCTOR).\nNon-Commerce students only. It cannot be counted for credit in the BCom program. If you are unable to register in a section of this course and you have been admitted by your Faculty to the Minor in Commerce or another approved program in which this course is a requirement, you may submit a registration request using the form available on the Sauder website: https://mybcom.sauder.ubc.ca/courses-money-enrolment/courses-and-registration/registration-assistance .\nStudents not meeting any of the criteria within the restricted seats remaining will only be able to register if there are general seats available.\nNOTE: Course registration is administered by the Sauder Undergraduate Office and NOT the instructor (DO NOT CONTACT THE INSTRUCTOR).\nThis section will be offered in a flexible learning format. Rather than attending traditional in-class lectures for three hours each week, students in a flexible format section will spend more time with online learning materials in preparation for fewer scheduled in-person meeting times. Instructors will provide exact dates for in-person meeting times closer to the start of term.\nNon-Commerce students only. NOTE: Course registration is administered by the Sauder Undergraduate Office and NOT the instructor (DO NOT CONTACT THE INSTRUCTOR).\n","courseName":"Introduction to Business Processes and Operations","courseNumber":"398","credits":"Credits: 3","description":"The design and management of systems that efficiently and effectively supply products and services to the end-user. The concepts apply to a variety of settings such as manufacturing, logistics, healthcare, and others (For non-Commerce students only).","sections":[{"section":"202"},{"section":"101"},{"section":"201"}]}