{"reqs":"There are discussion sections for this course. Please note: PHIL 101 and PHIL 102 are independent introductory courses and do not need to be taken in sequential order.\nPhilosophy challenges us with questions that are directed to our most basic intellectual assumptions and forces us to think hard about ourselves and our position in the world. With its focus on arguments, philosophy also brings clarity and rigour to matters that may otherwise seem inherently obscure and perplexing. Different instructors teach PHIL 101 in different ways. The approach I take doesnt emphasize historical analysis and wont touch on the many philosophical systems that are associated with the great philosophers of the past. Instead, the course will focus on a small number of philosophical problems and some important ways of thinking about them. Your job is to adopt a critical stance to the readings and to the lectures, and to develop your own views based on the arguments we wand~\nork through. Topics include: Does God exist? Do people have souls? Is there free will? Are there objective moral facts?\n\nThis discussion section is for students registered in PHIL 101 001.\nThis discussion section is for students registered in PHIL 101 001.\nThis discussion section is for students registered in PHIL 101 001.\nThis discussion section is for students registered in PHIL 101 001.\nThis discussion section is for students registered in PHIL 101 001.\nPlease note: PHIL 101 and PHIL 102 are independent introductory courses and do not need to be taken in sequential order.\nInstructor: Anders Kraal.\nThe course offers an overview of major themes in Western philosophy from Ancient Greece to contemporary discussions. We will consider such themes as knowledge of the world, the existence of God, free-will, and morality. We will study (and think critically about) how these questions have been responded to by some major philosophers, in particular Descartes, Hume, Kant, and Bertrand Russell.\n\nPlease note: PHIL 101 and PHIL 102 are independent introductory courses and do not need to be taken in sequential order.\nPhilosophy challenges us with questions that are directed to our most basic intellectual assumptions and forces us to think hard about ourselves and our position in the world. With its focus on arguments, philosophy also brings clarity and rigour to matters that may otherwise seem inherently obscure and perplexing. Different instructors teach PHIL 101 in different ways. The approach I take doesnt emphasize historical analysis and wont touch on the many philosophical systems that are associated with the great philosophers of the past. Instead, the course will focus on a small number of philosophical problems and some important ways of thinking about them. Your job is to adopt a critical stance to the readings and to the lectures, and to develop your own views based on the arguments we wand~\nork through. Topics include: Does God exist? Do people have souls? Is there free will? Are there objective moral facts?\n","courseName":"Introduction to Philosophy","courseNumber":"101","credits":"Credits: 3","description":"Basic problems and methods of philosophy. Topics such as the nature and scope of human knowledge, the existence of God, and the relationship between mind and body. Credit will be granted for only one of PHIL 100 or PHIL 101.","sections":[{"section":"L05"},{"section":"L04"},{"section":"001"},{"section":"002"},{"section":"003"},{"section":"L01"},{"section":"L03"},{"section":"L02"}]}