{"reqs":"Pre-reqs: (At least second year standing required.)\nThis is a Wait List Section for FNH 200 Section 101. Students will be moved according to their priority on the waitlist if space becomes available. All queries should be directed to the Faculty of Land and Food Systems Student Services at students@landfood.ubc.ca. Note: 1st year LFS students will only be considered for the lecture section once 2nd year standing requirements have been met through summer courses.\nThis is a Wait List Section for FNH 200 Section 102. Students will be moved according to their priority on the waitlist if space becomes available. All queries should be directed to the Faculty of Land and Food Systems Student Services at students@landfood.ubc.ca. Note: 1st year LFS students will only be considered for the lecture section once 2nd year standing requirements have been met through summer courses.\nThis is a Wait List Section for FNH 200 Section 103. Students will be moved according to their priority on the waitlist if space becomes available. All queries should be directed to the Faculty of Land and Food Systems Student Services at students@landfood.ubc.ca. Note: 1st year LFS students will only be considered for the lecture section once 2nd year standing requirements have been met through summer courses.\nThis is a Wait List Section for FNH 200 Section 99A. Students will be moved according to their priority on the waitlist if space becomes available. All queries should be directed to the Faculty of Land and Food Systems Student Services at students@landfood.ubc.ca.\nThis section of the course is ONLINE- distance education. Your instructor and course support staff will contact you by email prior to and during the course. Please ensure you have a valid email account. You will need your Campus Wide Login (CWL) to login to your course at https://www.elearning.ubc.ca/ . Course materials must be ordered or picked up at the UBC Bookstore. More information can be found under Distance Learning at : http://ctlt.ubc.ca/\nWhere applicable, please visit this site for examination information: http://www.students.ubc.ca/coursesreg/exams/\nPlease register in the waitlisted section 1W1 if this course is full.\nThis is a Wait List Section for FNH 200 Section 99E. Students will be moved according to their priority on the waitlist if space becomes available. All queries should be directed to the Faculty of Land and Food Systems Student Services at students@landfood.ubc.ca.\nThis section of the course is ONLINE- distance education. Your instructor and course support staff will contact you by email prior to and during the course. Please ensure you have a valid email account. You will need your Campus Wide Login (CWL) to login to your course at https://www.elearning.ubc.ca/ . Course materials must be ordered or picked up at the UBC Bookstore. More information can be found under Distance Learning at : http://ctlt.ubc.ca/\nPlease register in the waitlisted section 2W1 if the course is full\nWhere applicable, please visit this site for examination information: http://www.students.ubc.ca/coursesreg/exams/\nPlease register in the waitlisted section2W1 if this course is full.\n","courseName":"Exploring Our Food","courseNumber":"200","credits":"Credits: 3","description":"Chemical and physical properties of foods; issues pertaining to safety, nutritive value and consumer acceptability; government regulations pertaining to food safety, quality and additives; preservation techniques and transformation of agricultural commodities to food products; foods of the future.","sections":[{"section":"99A"},{"section":"101"},{"section":"102"},{"section":"103"},{"section":"99E"}]}