{"reqs":"Pre-reqs: Either (a) one of BIOL 111, BIOL 112, BIOL 153, BIOL 155 or (b) all of KIN 190, KIN 191. (At least second-year standing required.)\nThis is a Wait List Section for FNH 250 Section 001. Students will be moved according to their priority on the waitlist if space becomes available. All queries should be directed to the Faculty of Land and Food Systems Student Services at students@landfood.ubc.ca.\nThis is a Wait List Section for FNH 250 Section 003. Students with other forms of first-year BIOL credits (transfer or otherwise) should add themselves to the waitlist section. Students will be moved according to their priority on the waitlist if space becomes available. All queries should be directed to the Faculty of Land and Food Systems Student Services at students@landfood.ubc.ca.\nThis is a Wait List Section for FNH 250 Section 99A. Students will be moved according to their priority on the waitlist if space becomes available. All queries should be directed to the Faculty of Land and Food Systems Student Services at students@landfood.ubc.ca.\nThis section of the course is ONLINE- distance education. Your instructor and course support staff will contact you by email prior to and during the course. Please ensure you have a valid email account. You will need your Campus Wide Login (CWL) to login to your course at https://www.elearning.ubc.ca/ . Course materials must be ordered or picked up at the UBC Bookstore. More information can be found under Distance Learning at : http://ctlt.ubc.ca/\nWhere applicable, please visit this site for examination information: http://www.students.ubc.ca/coursesreg/exams/\nPlease register in the waitlisted section 1W1 if the course is full.\nThis is a Wait List Section for FNH 250 Section 99C. Students will be moved according to their priority on the waitlist if space becomes available. All queries should be directed to the Faculty of Land and Food Systems Student Services at students@landfood.ubc.ca.\nThis section of the course is ONLINE- distance education. Your instructor and course support staff will contact you by email prior to and during the course. Please ensure you have a valid email. You will need your Campus Wide Login (CWL) to login to your course at https://www.elearning.ubc.ca/ . Course materials must be ordered or picked up at the UBC Bookstore. More information can be found under Distance Learning at : http://ctlt.ubc.ca/\nWhere applicable, please visit this site for examination information: http://www.students.ubc.ca/coursesreg/exams/\nPlease register in the waitlisted section 2W1 if the course is full\n","courseName":"Nutrition Concepts and Controversies","courseNumber":"250","credits":"Credits: 3","description":"Fundamental concepts and principles of human nutrition applied to current nutrition issues.","sections":[{"section":"001"},{"section":"99A"},{"section":"003"},{"section":"99C"}]}