{"reqs":"Instructor: Jordan Dodd\nAn introduction to formal (sentential and predicate) logic. Students will learn to translate natural-language arguments into formal systems and evaluate their logical forms for validity. Emphasis on translation from natural language; truth tables and interpretations; proof systems up to relational predicate logic with identity. Also introductory metalogic, including proofs of soundness and completeness.\nThis course is a basic introduction to contemporary formal logic and reasoning. No previous familiarity with either logic or philosophy is required, although previous exposure to a critical reasoning course, PHIL 120, for example, would be an asset. You will learn how to symbolize and evaluate deductive arguments in sentential and predicate logic. Topics include natural language symbolization techniques; truth tables and interpretations; systems of natural deduction up to relational predicate logic with identity. The course will be of interest not only to philosophy students, but to all students interested in sharpening their logical skills and exploring the nature of reasoning.\nThis course examines elements of deductive logic, which is primarily concerned with valid inferences. These ideas are introduced using a special language called FOL, containing names for objects and predicates of those objects. This gives rise to basic sentences, and we look at ways to connect them, forming more complex sentences. This yields propositional logic. We then develop a proof system. We end with a more complex version of FOL, based on quantifiers and variables, which gives a correspondingly more complex means of expression, and a more complex system of deduction.\nThis course examines elements of deductive logic, which is primarily concerned with valid inferences. These ideas are introduced using a special language called FOL, containing names for objects and predicates of those objects. This gives rise to basic sentences, and we look at ways to connect them, forming more complex sentences. This yields propositional logic. We then develop a proof system. We end with a more complex version of FOL, based on quantifiers and variables, which gives a correspondingly more complex means of expression, and a more complex system of deduction.\n","courseName":"Symbolic Logic","courseNumber":"220","credits":"Credits: 3","description":"Sentential and predicate logic. Translation from natural language; truth tables and interpretations; systems of natural deduction up to relational predicate logic with identity; alternative proof methods. Some sections may use computer-based materials and tests.","sections":[{"section":"003"},{"section":"001"},{"section":"99A"},{"section":"002"},{"section":"99C"},{"section":"004"},{"section":"005"}]}