{"reqs":"Please note: PHIL 101 and PHIL 102 are independent introductory courses and need not be taken in sequential order.\nThis course offers an introduction to philosophy through an exploration of various practical puzzles and paradoxes found in contemporary moral philosophy, value theory, and decision theory. These include: the nature of morality, the trolley problem, the problem of moral luck, the non-identity problem, Parfits repugnant conclusion, the prisoners dilemma, and Newcombs paradox. No prior familiarity with philosophy is required for this course.\n\nPlease note: PHIL 101 and PHIL 102 are independent introductory courses and need not be taken in sequential order. Instructor: Irwin Chan\nThis discussion section is for students registered in PHIL 102 003.\nInstructor: Kelim Emmett\nPlease note: PHIL 101 and PHIL 102 are independent introductory courses and do not need to be taken in sequential order. This section is restricted to CAP PPE students\n\nThis course has mandatory discussion sections. Students must also register in one of the following sections: L01, L02, L03, L04, L05, or L06.\nPlease note: PHIL 101 and PHIL 102 are independent introductory courses and need not be taken in sequential order.\n\nThis discussion section is for students registered in PHIL 102 003.\nThis discussion section is for students registered in PHIL 102 003.\nThis discussion section is for students registered in PHIL 102 003.\nThis discussion section is for students registered in PHIL 102 003.\nThis discussion section is for students registered in PHIL 102 003.\nThis discussion section is for students registered in PHIL 102 003.\n","courseName":"Introduction to Philosophy II","courseNumber":"102","credits":"Credits: 3","description":"Basic problems and methods of philosophy. Topics such as morality, personal identity, free will and determinism, and the meaning of life. Credit will be granted for only one of PHIL 100 or PHIL 102.","sections":[{"section":"L05"},{"section":"L04"},{"section":"001"},{"section":"002"},{"section":"L06"},{"section":"003"},{"section":"004"},{"section":"L01"},{"section":"L03"},{"section":"L02"}]}