{"reqs":"Pre-reqs: Either (a) BIOL 112 and one of CHEM 123, CHEM 113; or (b) SCIE 001. (or (c) 8 transfer credits of first-year BIOL and 6 credits of first-year CHEM or (d) one of BIOL 112 or BIOL 121 and a corequisite of CHEM 203.)\nYou must register in this section (000), in a lecture section (101-105) and in a tutorial section (TXX).\nThis is the actual lecture section. Please also register in section 000 and in a tutorial section.\nIn this section, there will be mixed teaching modes including lecture, problem solving and data interpretation. In each lecture, important learning objectives will be outlined and students will have opportunities for an interactive learning experience.\nThis is the actual lecture section; also register section 000 and for a tutorial section.\nIn this section, there will be mixed teaching modes including lecture, problem solving and data interpretation. In each lecture, important learning objectives will be outlined and students will have opportunities for an interactive learning experience.\nThis is the actual lecture section; also register for section 000 and for a tutorial section.\nIn this section, there will be mixed teaching modes including lecture, problem solving and data interpretation. In each lecture, important learning objectives will be outlined and students will have opportunities for an interactive learning experience.\nThis is the actual lecture section; also register in section 000 and in a tutorial section.\nIn this section, there will be mixed teaching modes including lecture, problem solving and data interpretation. In each lecture, important learning objectives will be outlined and students will have opportunities for an interactive learning experience.\nThis is the actual lecture section; also register for section 000 and for a tutorial section.\nIn this section, there will be mixed teaching modes including lecture, problem solving and data interpretation. In each lecture, important learning objectives will be outlined and students will have opportunities for an interactive learning experience.\nThis is the wait list for section 101. You should register for this wait list only if you can not fit any of the available seats into your academic schedule. Registration on this list is not a guarantee that there will be a seat for you. As seats become available we will move students into the lecture section in the order of their registration priority.\nThis is the wait list for section 102. You should register for this wait list only if you can not fit any of the available seats into your academic schedule. Registration on this list is not a guarantee that there will be a seat for you. As seats become available we will move students into the lecture section in the order of their registration priority.\nThis is the wait list for section 104. You should register for this wait list only if you can not fit any of the available seats into your academic schedule. Registration on this list is not a guarantee that there will be a seat for you. As seats become available we will move students into the lecture section in the order of their registration priority.\nThis is the wait list for section 105. You should register for this wait list only if you can not fit any of the available seats into your academic schedule. Registration on this list is not a guarantee that there will be a seat for you. As seats become available we will move students into the lecture section in the order of their registration priority.\nThis is the wait-list for BIOL 200-000. Please do not contact course instructors about registration issues, as course registrations/ wait-lists are managed by the course registration coordinator. Students are moved in chronological order from the wait-list into the course as space becomes available. Timetables may be modified to allow for conflict-free registration. It is the student's responsibility to check SSC for registration changes. Information on wait-list positioning will not be provided.\n","courseName":"Fundamentals of Cell Biology","courseNumber":"200","credits":"Credits: 3","description":"Structure and function of plant and animal cells; membrane models, cytoplasmic organelles, biological information from gene to protein, the endomembrane system, secretion, intracellular digestion, endocytosis, transport processes, cytoskeleton and cell motility.","sections":[{"section":"T63"},{"section":"T62"},{"section":"T65"},{"section":"T64"},{"section":"T23"},{"section":"T22"},{"section":"T66"},{"section":"T25"},{"section":"T24"},{"section":"T26"},{"section":"T72"},{"section":"T71"},{"section":"T74"},{"section":"000"},{"section":"T73"},{"section":"T32"},{"section":"T76"},{"section":"T31"},{"section":"T34"},{"section":"T78"},{"section":"T33"},{"section":"T36"},{"section":"T38"},{"section":"T81"},{"section":"T83"},{"section":"T82"},{"section":"T41"},{"section":"T85"},{"section":"T84"},{"section":"T43"},{"section":"T42"},{"section":"T86"},{"section":"T45"},{"section":"T44"},{"section":"T03"},{"section":"T46"},{"section":"T05"},{"section":"T04"},{"section":"T06"},{"section":"T52"},{"section":"T51"},{"section":"101"},{"section":"T54"},{"section":"102"},{"section":"T53"},{"section":"T12"},{"section":"T56"},{"section":"103"},{"section":"T11"},{"section":"T55"},{"section":"104"},{"section":"105"},{"section":"T14"},{"section":"T58"},{"section":"T13"},{"section":"T57"},{"section":"T16"},{"section":"T15"},{"section":"T18"},{"section":"T17"}]}