{"reqs":"In 2017W, the topic for section 101 of HIST 105 is The Pacific War in History and Film. The course examines Japanese Pacific War films to see how Japan's contemporary history has been shaped by, and shapes, the presentation and memory of World War II in the Pacific.\nIn 2017W, the topic for section 201 of HIST 105 is History of the Modern Middle East: The Roots of Conflict. Beginning in the late Ottoman Empire and running to the present-day, this course introduces students to the history, politics and culture of the modern Middle East. With emphases on the impact of war, colonialism, nationalism, and Islamism on the diverse cultures and peoples of the region, the course aims to facilitate the adoption of an informed, critical approach to the study of the Middle Easts past and present. While there will be much discussion of military developments and the current violent entanglements in the region, we will also challenge the common but false notion of a region perpetually embroiled in conflict by engaging with social, cultural and intellectual trendsand~\n, looking to everyday life and common people in addition to major political events and personas. Finally, students will debate and interrogate popular representations of the region and its populations and will be encouraged to critically reflect on their own past and present visions of the Middle East.\nThis section is reserved for UBC Vantage College students only.\nThis section is reserved for UBC Vantage College students only.\nThis section is reserved for UBC Vantage College students only.\nThis section is reserved for UBC Vantage College students only.\nThis section is reserved for UBC Vantage College students only.\nThis section is reserved for UBC Vantage College students only.\nThis section is reserved for UBC Vantage College students only.\nThis section is reserved for UBC Vantage College students only.\nThis section is reserved for UBC Vantage College students only.\nThis section is reserved for UBC Vantage College students only.\n","courseName":"Contemporary Global Issues in Historical Perspective","courseNumber":"105","credits":"Credits: 3","description":"Places issues and problems of current relevance such as disease, terrorism, drugs, or ethnic conflict in historical perspective. Each section will explore a single theme. Check with department for course offerings.","sections":[{"section":"V01"},{"section":"V2A"},{"section":"V2C"},{"section":"V2B"},{"section":"V2E"},{"section":"V2D"},{"section":"V2G"},{"section":"V2F"},{"section":"L01"},{"section":"V2H"},{"section":"L03"},{"section":"L02"},{"section":"L04"},{"section":"101"},{"section":"201"},{"section":"V02"},{"section":"L1B"},{"section":"L1A"},{"section":"L1D"},{"section":"L1C"}]}