{"reqs":"NOTE: You must also sign up for a discussion section: D11 or D12. If this section if FULL or BLOCKED please sign up for Section 002 in Term 2 or for the corresponding wait list section - THTR 120, Section WL1. Once you have registered in the wait list there is no need to contact the Department. Your registration will be switched to the parent section when space becomes available. Preference may be given to Majors, Minors, or Honours students in Theatre or Film. For more information about Department of Theatre and Film wait lists please visit: http://theatrefilm.ubc.ca/undergraduate/undergraduate-courses/how-to-wait-list-a-course/\nDiscussion section for THTR 120, Section 001.\nDiscussion section for THTR 120, Section 001.\nThis is a WAITLIST section for THTR 120, Section 001. Once you have registered in the wait list there is no need to contact the Department. Your registration will be switched to the parent section when space becomes available. Preference may be given to Majors, Minors, or Honours students in Theatre or Film. For more information about Department of Theatre and Film wait lists please visit: http://theatrefilm.ubc.ca/undergraduate/undergraduate-courses/how-to-wait-list-a-course/\nNOTE: You must also sign up for a discussion section: D21 or D22. If this section if FULL or BLOCKED please sign up for THTR 120 Section 001 in Term 1 or for the corresponding wait list section - THTR 120, Section WL2. Once you have registered in the wait list there is no need to contact the Department. Your registration will be switched to the parent section when space becomes available. Preference may be given to Majors, Minors, or Honours students in Theatre or Film. For more information about Department of Theatre and Film wait lists please visit: http://theatrefilm.ubc.ca/undergraduate/undergraduate-courses/how-to-wait-list-a-course/\nDiscussion section for THTR 120, Section 002, Term 2.\nDiscussion section for THTR 120, Section 002, Term 2.\nThis is a wait list section for THTR 120, Section 002. Once you have registered in the wait list there is no need to contact the Department. Your registration will be switched to the parent section when space becomes available. Preference may be given to Majors, Minors, or Honours students in Theatre or Film. For more information about Department of Theatre and Film wait lists please visit: http://theatrefilm.ubc.ca/undergraduate/undergraduate-courses/how-to-wait-list-a-course/\n","courseName":"Introduction to Theatre","courseNumber":"120","credits":"Credits: 3","description":"Theory and practice of the theatrical arts. Attendance at plays is required.","sections":[{"section":"001"},{"section":"002"},{"section":"D21"},{"section":"D12"},{"section":"D11"},{"section":"D22"}]}